In [129]:
import pandas as pd
import numpy as np
import os

In [27]:
city = pd.read_csv('mens-march-mania-2022/MDataFiles_Stage1/Cities.csv')
conference = pd.read_csv('mens-march-mania-2022/MDataFiles_Stage1/Conferences.csv')
tourneygame = pd.read_csv('mens-march-mania-2022/MDataFiles_Stage1/MConferenceTourneyGames.csv')
gamecity = pd.read_csv('mens-march-mania-2022/MDataFiles_Stage1/MGameCities.csv')
ordinals = pd.read_csv('mens-march-mania-2022/MDataFiles_Stage1/MMasseyOrdinals.csv')
t_compact_result = pd.read_csv('mens-march-mania-2022/MDataFiles_Stage1/MNCAATourneyCompactResults.csv')
t_detailed_result = pd.read_csv('mens-march-mania-2022/MDataFiles_Stage1/MNCAATourneyDetailedResults.csv')
seed_round_slots = pd.read_csv('mens-march-mania-2022/MDataFiles_Stage1/MNCAATourneySeedRoundSlots.csv')
seed = pd.read_csv('mens-march-mania-2022/MDataFiles_Stage1/MNCAATourneySeeds.csv')
slots = pd.read_csv('mens-march-mania-2022/MDataFiles_Stage1/MNCAATourneySlots.csv')
reg_sea_comp_results = pd.read_csv('mens-march-mania-2022/MDataFiles_Stage1/MRegularSeasonCompactResults.csv')
reg_sea_detail_results = pd.read_csv('mens-march-mania-2022/MDataFiles_Stage1/MRegularSeasonDetailedResults.csv')
sample_subm_s1 = pd.read_csv('mens-march-mania-2022/MDataFiles_Stage1/MSampleSubmissionStage1.csv')
season = pd.read_csv('mens-march-mania-2022/MDataFiles_Stage1/MSeasons.csv')
second_t_comp_result = pd.read_csv('mens-march-mania-2022/MDataFiles_Stage1/MSecondaryTourneyCompactResults.csv')
second_t_teams= pd.read_csv('mens-march-mania-2022/MDataFiles_Stage1/MSecondaryTourneyTeams.csv')
coaches = pd.read_csv('mens-march-mania-2022/MDataFiles_Stage1/MTeamCoaches.csv')
team_conference = pd.read_csv('mens-march-mania-2022/MDataFiles_Stage1/MTeamConferences.csv')
team = pd.read_csv('mens-march-mania-2022/MDataFiles_Stage1/MTeams.csv')

In [59]:
reg_sea_detail_results.head()

,Season,DayNum,WTeamID,WScore,LTeamID,LScore,WLoc,NumOT,WFGM,WFGA,...,LFGA3,LFTM,LFTA,LOR,LDR,LAst,LTO,LStl,LBlk,LPF
0,2003,10,1104,68,1328,62,N,0,27,58,...,10,16,22,10,22,8,18,9,2,20
1,2003,10,1272,70,1393,63,N,0,26,62,...,24,9,20,20,25,7,12,8,6,16
2,2003,11,1266,73,1437,61,N,0,24,58,...,26,14,23,31,22,9,12,2,5,23
3,2003,11,1296,56,1457,50,N,0,18,38,...,22,8,15,17,20,9,19,4,3,23
4,2003,11,1400,77,1208,71,N,0,30,61,...,16,17,27,21,15,12,10,7,1,14

In [41]:
team.head()

   TeamID     TeamName  FirstD1Season  LastD1Season
0    1101  Abilene Chr           2014          2022
1    1102    Air Force           1985          2022
2    1103        Akron           1985          2022
3    1104      Alabama           1985          2022
4    1105  Alabama A&M           2000          2022

In [56]:
reg_sea_detail_results.shape

(100423, 34)

## Get season averages

In [58]:
x_train = reg_sea_detail_results[reg_sea_detail_results['Season'] < 2016]

In [86]:
w_columns = [col for col in x_train.columns if col.startswith('W') or col == 'Season']
selected_df_w = x_train.loc[:, w_columns]
renamed_df_w = selected_df_w.rename(columns=lambda x: x.replace('W', ''))
l_columns = [col for col in x_train.columns if col.startswith('L') or col == 'Season']
selected_df_l = x_train.loc[:, l_columns]
renamed_df_l = selected_df_l.rename(columns=lambda x: x.replace('L', ''))

In [87]:
stacked_df = pd.concat([renamed_df_w, renamed_df_l], axis=0, ignore_index=True)

In [91]:
stacked_df.drop('Loc', axis=1, inplace=True)

In [92]:
stacked_df.head()

,Season,TeamID,Score,FGM,FGA,FGM3,FGA3,FTM,FTA,OR,DR,Ast,TO,Stl,Blk,PF
0,2003,1104,68,27,58,3,14,11,18,14,24,13,23,7,1,22
1,2003,1272,70,26,62,8,20,10,19,15,28,16,13,4,4,18
2,2003,1266,73,24,58,8,18,17,29,17,26,15,10,5,2,25
3,2003,1296,56,18,38,3,9,17,31,6,19,11,12,14,2,18
4,2003,1400,77,30,61,6,14,11,13,17,22,12,14,4,4,20

In [93]:
x_train = stacked_df.groupby(['Season','TeamID']).mean()

In [94]:
x_train.head()

                   Score        FGM        FGA      FGM3       FGA3  \
Season TeamID
2003   1102    57.250000  19.142857  39.785714  7.821429  20.821429
       1103    78.777778  27.148148  55.851852  5.444444  16.074074
       1104    69.285714  24.035714  57.178571  6.357143  19.857143
       1105    71.769231  24.384615  61.615385  7.576923  20.769231
       1106    63.607143  23.428571  55.285714  6.107143  17.642857

                     FTM        FTA         OR         DR        Ast  \
Season TeamID
2003   1102    11.142857  17.107143   4.178571  16.821429  13.000000
       1103    19.037037  25.851852   9.777778  19.925926  15.222222
       1104    14.857143  20.928571  13.571429  23.928571  12.107143
       1105    15.423077  21.846154  13.500000  23.115385  14.538462
       1106    10.642857  16.464286  12.285714  23.857143  11.678571

                      TO       Stl       Blk         PF
Season TeamID
2003   1102    11.428571  5.964286  1.785714  18.750000
       1103    12.629630  7.259259  2.333333  19.851852
       1104    13.285714  6.607143  3.785714  18.035714
       1105    18.653846  9.307692  2.076923  20.230769
       1106    17.035714  8.357143  3.142857  18.178571

In [166]:
x_train.shape

(4428, 14)

In [133]:
y_train = t_compact_result[t_compact_result['Season'] < 2016]

In [134]:
y_train.head()

   Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
0    1985     136     1116      63     1234      54    N      0
1    1985     136     1120      59     1345      58    N      0
2    1985     136     1207      68     1250      43    N      0
3    1985     136     1229      58     1425      55    N      0
4    1985     136     1242      49     1325      38    N      0

In [152]:
y_train.WLoc.value_counts()

WLoc
N    1983
Name: count, dtype: int64

In [135]:
y_train_1 = y_train.loc[:,['Season', 'WTeamID','LTeamID', 'WScore', 'LScore']]
y_train_1.columns = ['Season', 'T1ID','T2ID','T1Score','T2Score']
y_train_2 = y_train.loc[:,['Season', 'LTeamID','WTeamID', 'LScore', 'WScore']]
y_train_2.columns = ['Season', 'T1ID','T2ID','T1Score','T2Score']

In [136]:
y_train_new = pd.concat([y_train_1, y_train_2], axis=0, ignore_index=True)

In [137]:
y_train_new.head()

   Season  T1ID  T2ID  T1Score  T2Score
0    1985  1116  1234       63       54
1    1985  1120  1345       59       58
2    1985  1207  1250       68       43
3    1985  1229  1425       58       55
4    1985  1242  1325       49       38

In [139]:
y_train_new['outcome'] = np.where(y_train_new['T1Score'] > y_train_new['T2Score'], 1, 0)

In [140]:
y_train_new.head()

   Season  T1ID  T2ID  T1Score  T2Score  outcome
0    1985  1116  1234       63       54        1
1    1985  1120  1345       59       58        1
2    1985  1207  1250       68       43        1
3    1985  1229  1425       58       55        1
4    1985  1242  1325       49       38        1

In [163]:
merged_df = y_train_new.merge(x_train, left_on=['Season', 'T1ID'], right_on=['Season', 'TeamID'], how = 'inner')
merged_df = merged_df.merge(x_train, left_on=['Season', 'T2ID'], right_on=['Season', 'TeamID'], how = 'inner', suffixes=('_T1', '_T2'))

In [164]:
merged_df.shape

(1694, 34)

In [167]:
merged_df.head()

,Season,T1ID,T2ID,T1Score,T2Score,outcome,Score_T1,FGM_T1,FGA_T1,FGM3_T1,...,FGA3_T2,FTM_T2,FTA_T2,OR_T2,DR_T2,Ast_T2,TO_T2,Stl_T2,Blk_T2,PF_T2
0,2003,1421,1411,92,84,1,71.206897,24.379310,56.793103,6.482759,...,18.500000,17.400000,28.066667,13.166667,24.800000,14.200000,15.233333,6.433333,2.233333,18.300000
1,2003,1112,1436,80,51,1,85.214286,30.321429,65.714286,7.035714,...,15.482759,12.862069,19.551724,12.965517,25.724138,14.206897,14.068966,6.862069,2.965517,15.896552
2,2003,1113,1272,84,71,1,75.965517,27.206897,56.896552,4.000000,...,20.068966,14.965517,22.896552,14.068966,25.965517,16.620690,13.793103,7.379310,5.068966,18.758621
3,2003,1141,1166,79,73,1,79.344828,26.620690,52.689655,6.827586,...,20.484848,13.878788,20.030303,10.878788,23.181818,16.818182,13.363636,8.393939,4.454545,17.272727
4,2003,1143,1301,76,74,1,74.482759,27.344828,58.724138,6.413793,...,22.500000,15.766667,20.466667,9.733333,22.033333,14.666667,14.200000,7.766667,3.066667,18.666667

In [161]:
seed.head()

   Season Seed  TeamID
0    1985  W01    1207
1    1985  W02    1210
2    1985  W03    1228
3    1985  W04    1260
4    1985  W05    1374

In [168]:
merged_df = merged_df.merge(seed, left_on=['Season', 'T1ID'], right_on=['Season', 'TeamID'], how = 'inner')
merged_df = merged_df.merge(seed, left_on=['Season', 'T2ID'], right_on=['Season', 'TeamID'], how = 'inner', suffixes=('_T1', '_T2'))

In [172]:
merged_df.drop(['TeamID_T1','TeamID_T2'], axis = 1, inplace= True)

In [156]:
coaches.head()

   Season  TeamID  FirstDayNum  LastDayNum       CoachName
0    1985    1102            0         154   reggie_minton
1    1985    1103            0         154     bob_huggins
2    1985    1104            0         154  wimp_sanderson
3    1985    1106            0         154    james_oliver
4    1985    1108            0         154   davey_whitney

In [173]:
merged_df = merged_df.merge(coaches, left_on=['Season', 'T1ID'], right_on=['Season', 'TeamID'], how = 'inner')
merged_df = merged_df.merge(coaches, left_on=['Season', 'T2ID'], right_on=['Season', 'TeamID'], how = 'inner', suffixes=('_T1', '_T2'))

In [175]:
merged_df.head()

,Season,T1ID,T2ID,T1Score,T2Score,outcome,Score_T1,FGM_T1,FGA_T1,FGM3_T1,...,Seed_T1,Seed_T2,TeamID_T1,FirstDayNum_T1,LastDayNum_T1,CoachName_T1,TeamID_T2,FirstDayNum_T2,LastDayNum_T2,CoachName_T2
0,2003,1421,1411,92,84,1,71.206897,24.379310,56.793103,6.482759,...,X16b,X16a,1421,0,154,eddie_biedenbach,1411,0,154,ronnie_courtney
1,2003,1112,1436,80,51,1,85.214286,30.321429,65.714286,7.035714,...,Z01,Z16,1112,0,154,lute_olson,1436,0,154,tom_brennan
2,2003,1113,1272,84,71,1,75.965517,27.206897,56.896552,4.000000,...,Z10,Z07,1113,0,154,rob_evans,1272,0,154,john_calipari
3,2003,1141,1166,79,73,1,79.344828,26.620690,52.689655,6.827586,...,Z11,Z06,1141,0,154,jay_smith,1166,0,154,dana_altman
4,2003,1143,1301,76,74,1,74.482759,27.344828,58.724138,6.413793,...,W08,W09,1143,0,154,ben_braun,1301,0,154,herb_sendek

In [176]:
merged_df.drop(['TeamID_T1','TeamID_T2','FirstDayNum_T1','FirstDayNum_T2', 'LastDayNum_T1', 'LastDayNum_T2'], axis = 1, inplace= True)

In [177]:
merged_df.shape

(1702, 38)